       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
      * <kcobol extract name="hello"
           DISPLAY 'Hello world!'.
      * /kcobol>
           STOP RUN.
